MichaelSun1999/IOT_SYSTEM_FOR_SMART_AGRICULTURE_ESP32_Linux/Node/Temp_Humi/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_I2C_HTS221_SCL_IO=33
CONFIG_I2C_HTS221_SDA_IO=34
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_DEVICE_NAME="ESP32S3_HTS221"
CONFIG_Temp_Humi=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_BLUFI_ENABLE=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2816
CONFIG_LWIP_L2_TO_L3_COPY=y
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y
CONFIG_LWIP_TCP_MSS=624
CONFIG_MBEDTLS_HARDWARE_MPI=n
CONFIG_MBEDTLS_DHM_C=y
